src/test/resources/income.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:docs="http://www.rumbe.ru/internal/services/checkDocumentService/docs">
    <soapenv:Header/>
    <soapenv:Body>
        <docs:checkDocumentRequest versionId="3.5">
            <docs:header>
                <docs:guid>e1392e52-ff97-4502-9959-a4bb510ef41e</docs:guid>
                <docs:subSystemFrom>OPSR</docs:subSystemFrom>
                <docs:documentType>create_bill</docs:documentType>
                <docs:documentName>createProphetBillNotice</docs:documentName>
                <docs:employmentType>IP</docs:employmentType>
                <docs:creationDateTime>2020-12-09T09:49:41.032+03:00</docs:creationDateTime>
                <docs:docParams>
                    <docs:param name="Code" value="21f"/>
                </docs:docParams>
            </docs:header>
            <docs:rumbeDocument>
                <timq:createProphetBillNotice xmlns:timq="http://www.rumbe.ru/create/createProphetBillNotice"
                                              metaType="document" Version="3.0">
                    <orgGuid xmlns="">e1392e52-ff97-4501-9951-a4bb510ef41e</orgGuid>
                    <TypeLock xmlns="">BlockID1</TypeLock>
                    <TypeStopedOperation xmlns="">StopOperKass</TypeStopedOperation>
                    <PersAccountNum xmlns="">03951001890</PersAccountNum>
                    <StartDateActive xmlns="">2020-08-21</StartDateActive>
                    <SI_TF_DOCSTATE xmlns="">Actualized</SI_TF_DOCSTATE>
                    <SI_TF_GUID xmlns="">e1392e52-ff97-4502-9959-a4bb510ef41e</SI_TF_GUID>
                </timq:createProphetBillNotice>
            </docs:rumbeDocument>
        </docs:checkDocumentRequest>
    </soapenv:Body>
</soapenv:Envelope>